Creates a FabricArea based on a host boundary.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2015
 Syntax
  C#
public static FabricArea Create(
	Document aDoc,
	Element hostElement,
	XYZ majorDirection,
	ElementId fabricAreaTypeId,
	ElementId fabricSheetTypeId
)
  Visual Basic
Public Shared Function Create ( _
	aDoc As Document, _
	hostElement As Element, _
	majorDirection As XYZ, _
	fabricAreaTypeId As ElementId, _
	fabricSheetTypeId As ElementId _
) As FabricArea
  Visual C++
public:
static FabricArea^ Create(
	Document^ aDoc,
	Element^ hostElement,
	XYZ^ majorDirection,
	ElementId^ fabricAreaTypeId,
	ElementId^ fabricSheetTypeId
)
 Parameters
  aDoc
 Type:  Autodesk.Revit.DB Document
 The document.
  hostElement
 Type:  Autodesk.Revit.DB Element
 The element that will host the FabricArea. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
  majorDirection
 Type:  Autodesk.Revit.DB XYZ
 A vector to define the major direction of the FabricArea.
  fabricAreaTypeId
 Type:  Autodesk.Revit.DB ElementId
 The id of the FabricAreaType.
  fabricSheetTypeId
 Type:  Autodesk.Revit.DB ElementId
 The id of the FabricSheetType.
 Return Value
 The newly created FabricArea.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentException   |   The document aDoc does not contain the element hostElement -or- the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet. -or- fabricAreaTypeId should refer to an FabricAreaType element. -or- fabricSheetTypeId should refer to an FabricSheetType element.
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
   Autodesk.Revit.Exceptions ArgumentOutOfRangeException   |   majorDirection has zero length.
   Autodesk.Revit.Exceptions DisabledDisciplineException   |   None of the following disciplines is enabled: Structural.
 See Also
  FabricArea Class
  Create Overload
  Autodesk.Revit.DB.Structure Namespace